docs(readme): update README to a mermaid diagram
